In [1]:
import numpy as np
import pandas as pd
import scipy 
from scipy import stats










m	=	mean

mu	=	theoretical value

s	=	standard deviation(std)

{n}	=	variable set size(Count)

t	=	Student's t-test

t=(m-mu)/(s/(n^1/2))

significance level(alpha) 5% = 0.05

In [2]:
df = pd.read_csv('Cutlets.csv')

In [3]:
df

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [4]:
df.shape

(35, 2)

In [5]:
df.isnull().sum()

Unit A    0
Unit B    0
dtype: int64

In [6]:
df.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  35 non-null     float64
 1   Unit B  35 non-null     float64
dtypes: float64(2)
memory usage: 688.0 bytes

In [8]:
stats.ttest_ind( df['Unit A'],df['Unit B'])

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

# Here the value of p (0.47) is greater than the value of alpha (0.05) so we will accept the null hypothesis and the size of sample are same

Answer 2

Significance level (alpha) = 0.05

In [10]:
df1 = pd.read_csv('LabTAT.csv')

In [11]:
df1

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [12]:
import scipy.stats as stats
stats.f_oneway(df1.iloc[:,0], df1.iloc[:,1],df1.iloc[:,2],df1.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

# Here the value of p (0.76) is less than the value of alpha (0.05) so we will reject the null hypothesis and the Average TAT are Different for each Laboratory.

Answer 3

In [13]:
from scipy.stats import chi2_contingency

In [14]:
df2 = pd.read_csv('BuyerRatio.csv')
df2

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [17]:
data = [[50, 142, 131, 70], [435, 1523, 1356, 750]]
stat, p, dof, expected = chi2_contingency(data)

Significance level (alpha) = 0.05

In [18]:
alpha = 0.05
print("p value is " + str(p))
if p <= alpha:
    print('Dependent (reject H0)')
else:
    print('Independent (H0 holds true)')

p value is 0.6603094907091882
Independent (H0 holds true)

# Here the value of p (0.66) is greater than the value of alpha (0.05) so we will accept the null hypothesis and all proportions are equal

Answer 4

In [22]:
df3 = pd.read_csv('Costomer+OrderForm.csv')
df3

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [32]:
df3[['Phillippines','Indonesia','Malta','India']] = df3[['Phillippines','Indonesia','Malta','India']].replace({'Error Free':0, 'Defective':1})
df3

     Phillippines  Indonesia  Malta  India
0               0          0      1      0
1               0          0      0      1
2               0          1      1      0
3               0          0      0      0
4               0          0      1      0
..            ...        ...    ...    ...
295             0          0      0      0
296             0          0      0      0
297             0          0      1      0
298             0          0      0      0
299             0          1      1      0

[300 rows x 4 columns]

In [33]:
df3.describe()

       Phillippines   Indonesia       Malta       India
count    300.000000  300.000000  300.000000  300.000000
mean       0.096667    0.110000    0.103333    0.066667
std        0.295997    0.313413    0.304902    0.249861
min        0.000000    0.000000    0.000000    0.000000
25%        0.000000    0.000000    0.000000    0.000000
50%        0.000000    0.000000    0.000000    0.000000
75%        0.000000    0.000000    0.000000    0.000000
max        1.000000    1.000000    1.000000    1.000000

In [34]:
df3[['Phillippines','Indonesia','Malta','India']] = df3[['Phillippines','Indonesia','Malta','India']].astype(int)
df3

     Phillippines  Indonesia  Malta  India
0               0          0      1      0
1               0          0      0      1
2               0          1      1      0
3               0          0      0      0
4               0          0      1      0
..            ...        ...    ...    ...
295             0          0      0      0
296             0          0      0      0
297             0          0      1      0
298             0          0      0      0
299             0          1      1      0

[300 rows x 4 columns]

In [35]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Phillippines  300 non-null    int32
 1   Indonesia     300 non-null    int32
 2   Malta         300 non-null    int32
 3   India         300 non-null    int32
dtypes: int32(4)
memory usage: 4.8 KB

In [36]:
stats.f_oneway(df3['Phillippines'],df3['Indonesia'],df3['Malta'],df3['India'])

F_onewayResult(statistic=1.286168556089167, pvalue=0.2776780955705948)

# Here the value of p (0.27) is greater than the value of alpha (0.05) so we will accept the null hypothesis and the defective % didnot varies by centre